edanesh/EVAL-ADICUP360/projects/ADuCM360_demo_cn0395/src/CN0395.c
/*!
 *****************************************************************************
 * @file:    CN0395.c
 * @brief:
 * @version: $Revision$
 * @date:    $Date$
 *-----------------------------------------------------------------------------
 *
Copyright (c) 2017 Analog Devices, Inc.

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:
  - Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.
  - Redistributions in binary form must reproduce the above copyright notice,
    this list of conditions and the following disclaimer in the documentation
    and/or other materials provided with the distribution.
  - Modified versions of the software must be conspicuously marked as such.
  - This software is licensed solely and exclusively for use with processors
    manufactured by or for Analog Devices, Inc.
  - This software may not be combined or merged with other code in any manner
    that would cause the software to become subject to terms and conditions
    which differ from those listed here.
  - Neither the name of Analog Devices, Inc. nor the names of its
    contributors may be used to endorse or promote products derived
    from this software without specific prior written permission.
  - The use of this software may or may not infringe the patent rights of one
    or more patent holders.  This license does not release you from the
    requirement that you obtain separate licenses from these patent holders
    to use this software.

THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS "AS IS" AND ANY
EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, NON-INFRINGEMENT,
TITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN
NO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF CLAIMS OF INTELLECTUAL
PROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *****************************************************************************/

#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>

#include "UrtLib.h"
#include "ClkLib.h"
#include <FeeLib.h>

#include <ADUCM360.h>
#include <CN0395.h>
#include "Communication.h"
#include "Timer.h"

#include <ADN8810.h>
#include <AD7988.h>
#include <SHT30.h>
#include <Flash.h>

/************************* Variable Definitions ******************************/

uint32_t RsTime = 0;
uint8_t ui8ContinousRsMeasurement = 0;

/* Available commands */
char *CmdCommands[] = {
	"help",
	"calibration",
	"operation",
	"current",
	"voltage",
	"resistance",
	"temperature",
	""
};

/* Functions for available commands */
cmdFunc CmdFun[] = {
	CN0395_CmdHelp,
	CN0395_CmdCalibration,
	CN0395_CmdSetOpMode,
	CN0395_CmdSetHeaterCurrent,
	CN0395_CmdSetHeaterVoltage,
	CN0395_CmdSetHeaterRes,
	CN0395_CmdSetHeaterTemp,
	NULL
};

/************************* Functions Definitions ******************************/

/**
 * @brief Calls the init functions for SPI, I2C and UART
 *
 * @param  None.
 *
 * @return  None.
**/
void CN0395_Init(void)
{
	/* Initialize SPI */
	SPI_Init();
	/* Initialize I2C */
	I2C_Init();
	/* Initialize UART port */
	UART_Init (B9600, COMLCR_WLS_8BITS);
}

/**
   @brief Command line process function

   @return none
**/
void CN0395_CmdProcess(sMeasurementVariables *sMeasVar)
{
	cmdFunc   func;

	func = CN0395_FindCommand((char *)
				  uart_rx_buffer);    /* Find needed function based on typed command */

	if (func) {                                           /* Check if there is a valid command */
		AppPrintf("\n");
		(*func)(&uart_rx_buffer[2],
			sMeasVar);             /* Call the desired function */
	} else if (strlen((char *)uart_rx_buffer) !=
		   0) {     /* Check if there is no match for typed command */
		AppPrintf("\n");
		AppPrintf("Unknown command!");                     /* Display a message for unknown command */
		AppPrintf("\n");
	} else { // if just <ENTER> is pressed, make a new measurement and display RS data
		ui8ContinousRsMeasurement ^= 1;
	}
}

/**
   @brief Find available commands

   @param cmd - command to search

   @return cmdFunc - return the specific function for available command or NULL for invalid command
**/
cmdFunc CN0395_FindCommand(char *cmd)
{
	cmdFunc func = NULL;
	int i = 0;

	while (CmdFun[i] != NULL) {
		if (strncmp(cmd, CmdCommands[i], 6) == 0) {
			func = CmdFun[i];
			break;
		}
		i++;
	}

	return func;
}

/**
   @brief Command Prompt function

   @return res - UART_SUCCESS
**/
int CN0395_CmdPrompt(void)
{
	int res;

	res = UART_WriteChar(_CR, UART_WRITE_NO_INT);

	if (res == UART_SUCCESS) {
		res = UART_WriteChar(_LF, UART_WRITE_NO_INT);
	}

	if (res == UART_SUCCESS) {
		UART_WriteChar('>', UART_WRITE_NO_INT);
	}
	uart_rcnt = 0;

	return res;
}

/**
   @brief Compute RH, PH and TH and update sMeasVar struct with the new values

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @return None.
**/
void CN0395_ComputeHeaterRPT(sMeasurementVariables *sMeasVar)
{
	float    fHeaterVoltage;
	float    fHeaterRes;
	float    fAmbientHeaterTemp;
	float    fAmbientHeaterHum;
	float    fHeaterCurrent;
	float    fHeaterPower;
	float    fHeaterTemp;

//	const float fHeaterNomimalRes = 110; // RH_0 = 110Ω @ 20°C // unused for AS modified board

	fHeaterVoltage = sMeasVar->fHeaterVoltage;
	fHeaterCurrent = sMeasVar->fHeaterCurrent;
	// Calculate RH = VH/IH
	fHeaterRes = (fHeaterVoltage / fHeaterCurrent) * pow(10, 3); // Ω

	// Calculate PH = VH*IH
	fHeaterPower = fHeaterVoltage * fHeaterCurrent; // mW

	// Read T_A and HUM from temperature/humidity sensor
	SHT30_Update(&fAmbientHeaterTemp, &fAmbientHeaterHum);

	/* RH_T = RH_A [ 1 + ALPHA*(RH_0/RH_A)*(T – T_A)] - solve for T as a function of RH_T:
	 * T =  (RH_T – RH_A) / (ALPHA * RH_0) + T_A
	 */
//	fHeaterTemp = (fHeaterRes - sMeasVar->fAmbientHeaterRes) /
//		      (ALPHA * fHeaterNomimalRes) + fAmbientHeaterTemp;
	/* for AS modified board:
	 * RH_T = RH_A [ 1 + ALPHA*(RH_0/RH_A)*(T – T_A)] - solve for T as a function of RH_T:
	 * T =  (RH_T - RH_A) / (ALPHA)
	 */
	fHeaterTemp = ((fHeaterRes / sMeasVar->fzeroHeaterRes) - 1) / ALPHA;

	sMeasVar->fHeaterRes = fHeaterRes;
	sMeasVar->fAmbientHeaterTemp = fAmbientHeaterTemp;
	sMeasVar->fAmbientHeaterHum = fAmbientHeaterHum;
	sMeasVar->fHeaterPower = fHeaterPower;
	sMeasVar->fHeaterTemp = fHeaterTemp;
}

/**
   @brief After initialization, circuit resets then measures heater ambient temperature T_A,
          humidity HUM, then ambient temperature heater resistance RH_A. Save T_A, HUM, RH_A.
          Also reads the correction factor (K1) from the permanent memory.
          Moreover, it is assumed that init is performed in clean air, therefore we measure Ro.

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @return None.
**/
void CN0395_PowerOn(sMeasurementVariables *sMeasVar)
{
	uint16_t ui16AdcData;
	float    fHeaterVoltage;
	float    fAmbientHeaterRes;
	float    fAmbientHeaterTemp;
	float    fAmbientHeaterHum;
	float    fzeroHeaterRes; // new variable for AS modified board
	uint32_t ui32CalibrationData[2];

	// Enable master power on IO5 and reset DAC
	ADN8810_Init();

