edanesh/EVAL-ADICUP360/projects/ADuCM360_demo_cn0395/src/CN0395.c
	// Switch to RH mode and disable RS switches, delay 50ms
	AD7988_SetOperationMode(AD7988_RH_MODE);
	sMeasVar->OpMode = AD7988_RH_MODE;

	// Read from permanent memory the calibration data
	ReadFromFlash(ui32CalibrationData, 0x1f000, sizeof(ui32CalibrationData));
	if (ui32CalibrationData[0] ==
	    1) { // first element of the array is the information if calibration has been performed before
		// The second element of the array is the gain calibration factor which needs to be converted from uint32_t to float
		sMeasVar->K1 = (float)(ui32CalibrationData[1] / 10000) + (float)(
				       ui32CalibrationData[1] % 10000) / 10000;
	} else {
		// In the case that Factory Calibration has never been performed before, use gain calibration factor of 1
		sMeasVar->K1 = 1;
	}

	timer_sleep(50);

	// Set default heater current to 8mA
	sMeasVar->fHeaterCurrent = 8;
	ADN8810_SetOutput(sMeasVar->fHeaterCurrent, sMeasVar);

	/* Delay 20uS; this is long enough for DAC current to settle, but not long enough for heater temp to change
	we use this routine for AS modified sensor to estimate ambient RH, assuming 8mA is low enough to not heat up the sensor
	There is a risk that the sensor is not cool (at ambient T) when this measurement is done,
	so operator must be careful otherwise read value will be wrong
	*/
//	timer_sleep_5uS(4);
	timer_sleep(2000);

	ui16AdcData = CN0395_ReadAdc(sMeasVar);
	fHeaterVoltage = AD7988_DataToVoltage(ui16AdcData);
	// Calculate RH_A = VH_A / 8mA
	fAmbientHeaterRes = (fHeaterVoltage / sMeasVar->fHeaterCurrent) * pow(10, 3);

	// Read T_A and HUM from temperature/humidity sensor
	SHT30_Update(&fAmbientHeaterTemp, &fAmbientHeaterHum);

	// Calculate RH_o = RH_A / (1 + ALPHA * T_A)
	fzeroHeaterRes = fAmbientHeaterRes / (1 + ALPHA * fAmbientHeaterTemp);

	// Store some init measurement values for future calculations
	sMeasVar->fAmbientHeaterRes = fAmbientHeaterRes;
	sMeasVar->fzeroHeaterRes = fzeroHeaterRes; // new for AS modified board
	sMeasVar->fHeaterVoltage = fHeaterVoltage;
	sMeasVar->fAmbientHeaterTemp = fAmbientHeaterTemp;
	sMeasVar->fAmbientHeaterHum = fAmbientHeaterHum;

	/* not in use for AS modified board
	CN0395_ComputeHeaterRPT(sMeasVar); // Compute RH, PH and TH

	// At power up, perform a Ro measurement and store it for future use
	sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
	while (sMeasVar->fSensorResCleanAir <
	       0) { // in case of error, repeat measurement
		timer_sleep(500);
		sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
	}
	*/
}

/**
   @brief Routine for measuring sensor resistance RS:
          - Set IO6 to logic 1 enable switches
          - Set IN1 to logic 0 to connect ADC to RS sensor resistor
          - Use the gain ranging algorithm to determine the value of RS

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @return None.
**/
float CN0395_MeasureSensorResistance(sMeasurementVariables *sMeasVar)
{
	float    fRS = 0;
	float    VS;
	uint16_t ui16AdcData;
	uint32_t ui32RgValue = 0;
	int8_t  i8GainRangingIndex = AD7988_RS_RAMGE_5;
	uint32_t GainRangingTh[5][4] = {
		{442, 8870, 1922, 132},
		{393, 39200, 10263, 3330},
		{3468, 110000, 56753, 84000},
		{3492, 2740000, 57175, 2119971},
		{7171, 33300000, 62415, 1909936}
	};

	// Gain ranging algorithm, needs to be run with every sensor measurement
	while (i8GainRangingIndex >= AD7988_RS_RAMGE_1) {

		AD7988_SetOperationMode(i8GainRangingIndex);
		sMeasVar->OpMode = i8GainRangingIndex;

		ui16AdcData = CN0395_ReadAdc(sMeasVar);

		if(ui16AdcData > GainRangingTh[i8GainRangingIndex][2]) {
			AppPrintf("\r\nADC Data Error  = %d ", ui16AdcData);
//			return -1; -1 stops the board from other operations, so we just change it to 1 to continue
			return 1;
		}
		// ADC Data is bellow the threshold switch to the next gain
		else if (ui16AdcData < GainRangingTh[i8GainRangingIndex][0]) {
			i8GainRangingIndex--;
		} else { // ADC read data is in the correct range --> calculate RS
			AD7988_SetOperationMode(AD7988_RH_MODE);
			ui32RgValue = GainRangingTh[i8GainRangingIndex][1];
			fRS = CN0395_CalculateRs(ui16AdcData, ui32RgValue);
			VS = AD7988_DataToVoltage(ui16AdcData);
			sMeasVar->fSensorVoltage = VS;
			sMeasVar->ui32GainResistance = ui32RgValue;
			sMeasVar->fSensorRes = fRS;
			sMeasVar->fPPM = CN0395_CalculatePPM(sMeasVar);

			if (fRS > GainRangingTh[i8GainRangingIndex][3]) { // RS exceeds max value
				return -1;
			}

			return fRS;
		}
	}
	return 0; // never reached
}

/**
 * @brief Display measured and calculation data (on UART).
 *
 * @param sMeasVar - pointer to the struct that contains all the relevant measurement variables.

 * @return None.
**/
void CN0395_DisplayData(sMeasurementVariables *sMeasVar)
{
	char *percent = "%";

	if(sMeasVar->OpMode == AD7988_RH_MODE) {
		AppPrintf("\r\nAvailable data for RH mode:");
		UART_WriteString("\r\n");
		AppPrintf("\r\nAmbient Heater Res:  RH_A  = %.2f [Ohms]",
			  sMeasVar->fAmbientHeaterRes);
		AppPrintf("\r\nHeater Voltage:      VH    = %.4f [V]",
			  sMeasVar->fHeaterVoltage);
		AppPrintf("\r\nHeater Current:      IH    = %.4f [mA]",
			  sMeasVar->fHeaterCurrent);
		AppPrintf("\r\nHeater Resistance:   RH    = %.2f [Ohms]",
			  sMeasVar->fHeaterRes);
		AppPrintf("\r\nHeater Power:        PH    = %.4f [mW]",
			  sMeasVar->fHeaterPower);
		AppPrintf("\r\nHeater Temp:         TH    = %.2f [C]",
			  sMeasVar->fHeaterTemp );
		AppPrintf("\r\nAmbient Heater Temp: T_A   = %.2f [C]",
			  sMeasVar->fAmbientHeaterTemp);
		AppPrintf("\r\nAmbient Heater Hum:  HUM   = %.2f [%s]",
			  sMeasVar->fAmbientHeaterHum, percent);

//		AppPrintf("\r\nADC Data                   = 0x%x",
//			  sMeasVar->ui16LastAdcDataRead);
//		AppPrintf("\r\nSensor Res Air:      Ro    = %.2f [Ohms]",
//			  sMeasVar->fSensorResCleanAir);
//		AppPrintf("\r\nSensor Resistance:      Rs    = %.2f [Ohms]",
//			  sMeasVar->fSensorRes);
	} else {
		AppPrintf("\r\nAvailable data for RS mode:");
		UART_WriteString("\r\n");
		AppPrintf("\r\nSensor Resistance:      Rs    = %.2f [Ohms]",
			  sMeasVar->fSensorRes);
//		AppPrintf("\r\nSensor Resistance Air:  Ro    = %.2f [Ohms]",
//			  sMeasVar->fSensorResCleanAir);
//		AppPrintf("\r\nGas Concentration       C     = %.2f [PPM]", sMeasVar->fPPM);
		AppPrintf("\r\nSensor Voltage:         Vs    = %.4f [V]",
			  sMeasVar->fSensorVoltage);
		AppPrintf("\r\nHeater Resistance:   RH    = %.2f [Ohms]",
			  sMeasVar->fHeaterRes);
		AppPrintf("\r\nHeater Voltage:         VH    = %.4f [V]",
			  sMeasVar->fHeaterVoltage);
		AppPrintf("\r\nHeater Current:      IH    = %.4f [mA]",
			  sMeasVar->fHeaterCurrent);
		AppPrintf("\r\nHeater Temp:         TH    = %.2f [C]",
			  sMeasVar->fHeaterTemp );
		AppPrintf("\r\nAmbient Heater Temp:    T_A   = %.2f [C]",
			  sMeasVar->fAmbientHeaterTemp);
		AppPrintf("\r\nAmbient Heater Hum:     HUM   = %.2f [%s]",
			  sMeasVar->fAmbientHeaterHum, percent);

		/* simplified output
		AppPrintf("%.2f,",
			  sMeasVar->fSensorRes);
		AppPrintf("%.4f,",
			  sMeasVar->fSensorVoltage);
		AppPrintf("%.2f,",
			  sMeasVar->fHeaterTemp);
		AppPrintf("%.4f,",
			  sMeasVar->fHeaterVoltage);
		AppPrintf("%.2f,",
			  sMeasVar->fAmbientHeaterTemp);
		AppPrintf("%.2f",
			  sMeasVar->fAmbientHeaterHum);
		//simplified output */
	}
	UART_WriteString("\r\n");
}

/**
   @brief Display info for <help> command

   @param args - pointer to the arguments on the command line.

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables.

   @return none
**/
void CN0395_CmdHelp(uint8_t *args, sMeasurementVariables *sMeasVar)
{
	uint8_t        *p = args;
	char           arg[4];
	while (*(p = CN0395_FindArgv(p)) !=
	       '\0') {         /* Check if this function gets an argument */
		CN0395_GetArgv(arg, p);
	}

	AppPrintf("\n");
	AppPrintf("Available commands:\n");
	AppPrintf("\n");
	AppPrintf("Press the <ENTER> key  - Start/Stop continuous sensor measurement \n");
	AppPrintf("operation <mode>       - Set the desired operation mode: heater or sensor and perform a single measurement \n");
	AppPrintf("                         <mode> = RH, RS\n");
	AppPrintf("calibration <r/w>      - Full scale calibration routine.\n");
	AppPrintf("                         The calibration ensures that the exact ADN8810 output current is known\n");
	AppPrintf("                         and the calibration constant (K1) is stored.\n");
	AppPrintf("                         <r/w> = r read K1 stored in the permanent memory\n");
	AppPrintf("                         <r/w> = w perform a factory calibration and store K1 in memory\n");
}

/**
   @brief Run the calibration routine and display the calibration correction factor

   @param args - pointer to the arguments on the command line.

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables.

   @return none
**/
void CN0395_CmdCalibration(uint8_t *args, sMeasurementVariables *sMeasVar)
{
	uint8_t        *p = args;
	char           arg[4];
	uint32_t       ui32CalibrationData[2];
	float          K1 = 0;

	while (*(p = CN0395_FindArgv(p)) !=
	       '\0') {         /* Check if this function gets an argument */
		CN0395_GetArgv(arg, p);
	}

	// Read the correction factor K1 stored in permanent memory
	if(strncmp(arg, "r", 2) == 0) {
		ReadFromFlash(ui32CalibrationData, 0x1f000, sizeof(ui32CalibrationData));

		if(ui32CalibrationData[0] ==
		    1) { // this array also stores the information if calibration has already been performed
			K1 = (float)(ui32CalibrationData[1] / 10000) + (float)(ui32CalibrationData[1] %
					10000) / 10000;
			AppPrintf("\n");
			AppPrintf("Gain correction factor (K1) stored in memory is: %.4f", K1);
			AppPrintf("\n");
		} else {
			AppPrintf("\n");
			AppPrintf("Factory calibration hasn't been performed yet, default K1 value is 1");
			AppPrintf("\nType <calibrate w> to perform the factory calibration...");
			AppPrintf("\n");
		}
	}
	// Perform a new calibration routine and store K1 in permanent memory
	else if(strncmp(arg, "w", 2) == 0) {

//		AppPrintf("\nPlace the P2 jumper between P2-1 and P2-2 (RCAL1) and press <c> key");
		AppPrintf("\nPlace the P2 jumper between P2-3 and P2-4 (RCAL2) and press <c> key");
		AppPrintf("\n");

		char response = '\0';
		while (response != 'c') {
			UART_ReadChar(&response);   // Read character from UART
		}
		AppPrintf("\n");

		FeePErs(0x1f000);
		ui32CalibrationData[0] =
			1; // Factory calibration has been performed, save this information in permanent memory
		ui32CalibrationData[1] =
			ADN8810_FactoryCalibration(); // Save gain calibreation factor in permanent memory
		WriteToFlash(ui32CalibrationData, 0x1f000, sizeof(ui32CalibrationData));

		K1 = (float)(ui32CalibrationData[1] / 10000) + (float)(ui32CalibrationData[1] %
				10000) / 10000;
		sMeasVar->K1 = K1;
		AppPrintf("\n");
		AppPrintf("Gain correction factor (K1) stored in memory is: %.4f", K1);
		AppPrintf("\n");
	}
}

/**
   @brief Update operation mode according to operation command: RH, RS or RO

   @param args - pointer to the arguments on the command line.

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables.

   @return none
**/
void CN0395_CmdSetOpMode(uint8_t *args, sMeasurementVariables *sMeasVar)
{
	uint8_t        *p = args;
	char           arg[4];

	while (*(p = CN0395_FindArgv(p)) !=
	       '\0') {         /* Check if this function gets an argument */
		CN0395_GetArgv(arg, p);
	}

	if(strncmp(arg, "RH", 3) == 0) {
		sMeasVar->OpMode = AD7988_RH_MODE;
		AppPrintf("\n\tHeater mode of operation\n");
		AppPrintf("Input desired value...\n");
		AppPrintf("\n");
		AppPrintf("voltage <V>            - Constant Voltage (input voltage VH, 1.8V default)\n");
		AppPrintf("                         <V> ex: 1.8, 2, ... \n");
		AppPrintf("resistance <ohms>      - Constant Resistance (input resistance RH, 225Ohms default) \n");
		AppPrintf("                         <ohms> ex: 225, ... \n");
		AppPrintf("temperature <C>        - Constant T (input TH, 360 Celsius default)  \n");
		AppPrintf("                         <C> ex: 360, ... \n");
		AppPrintf("current <mA>           - Constant Current (Input IH, 8mA default)  \n");
		AppPrintf("                         <mA> ex: 8.49, ... \n");
	} else if(strncmp(arg, "RS", 3) == 0) {
		CN0395_MeasureSensorResistance(sMeasVar);
		CN0395_DisplayData(sMeasVar);
	}
}

/**
   @brief Routine for Setting Heater Current to Constant Current  IH (The default value is IH = 8mA)

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @return None.
**/
void CN0395_CmdSetHeaterCurrent(uint8_t *args, sMeasurementVariables *sMeasVar)
{
	uint8_t  *p = args;
	char     arg[3];
	float    fDesiredHeaterCurrent;
	uint16_t ui16AdcData;
	float    fHeaterVoltage;

	while (*(p = CN0395_FindArgv(p)) !=
	       '\0') {         /* Check if this function gets an argument */
		CN0395_GetArgv(arg, p);
	}

	fDesiredHeaterCurrent = atof(arg); // convert string to float

	if (ADN8810_SetOutput(fDesiredHeaterCurrent,
			      sMeasVar) > 0) { // max current is 50 mA??
		AD7988_SetOperationMode(AD7988_RH_MODE);

