edanesh/EVAL-ADICUP360/projects/ADuCM360_demo_cn0395/src/CN0395.c
		timer_sleep(7000); // delay 7s to account for slow thermal response of AS sensor (ceramic vs MEMS)

		ui16AdcData = CN0395_ReadAdc(sMeasVar);
		fHeaterVoltage = AD7988_DataToVoltage(ui16AdcData);
		timer_sleep(50); // delay 50ms

		sMeasVar->fHeaterCurrent = fDesiredHeaterCurrent;
		sMeasVar->fHeaterVoltage = fHeaterVoltage;
		CN0395_ComputeHeaterRPT(sMeasVar); // Compute RH, PH and TH
		// Update Ro value //not in use for AS modified board
//		sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//		while (sMeasVar->fSensorResCleanAir <
//		       0) { // in case of error, repeat measurement
//			timer_sleep(500);
//			sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//		}
		sMeasVar->OpMode = AD7988_RH_MODE;
		CN0395_DisplayData(sMeasVar);
	} else {
		AppPrintf("\n");
		AppPrintf("Cannot set heater current (IH) to %f. Maximum full scale current is %.2f mA!",
			  fDesiredHeaterCurrent, ADN8810_IFS);
		AppPrintf("\n");
	}
}

/**
   @brief Routine for error correction. Depending on the enSubroutine parameter, the correction is done either for voltage or resistance

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @param fInputCurrent - input current

   @param fDesiredValue - desired VH or desired RH

   @param enSubroutine - RESISTANCE or VOLTAGE

   @return None.
**/
//static void CN0395_CorrectError(sMeasurementVariables *sMeasVar,
//				float fInputCurrent,
//				float fDesiredValue,
//				enCN0395ErrCorrection enSubroutine)

void CN0395_CorrectError(sMeasurementVariables *sMeasVar,
	float fInputCurrent,
	float fDesiredValue,
	enCN0395ErrCorrection enSubroutine)
{
	float    fError = 1;
	uint16_t ui16AdcData = 0;
	float    fVoltage = 0;
	float    fActualValue;

	while (fError > 0.005) { // repeat until the error is less than 0.5%
		if (ADN8810_SetOutput(fInputCurrent, sMeasVar) > 0) {
			timer_sleep(500); // delay 500ms for stabilization to account for slow response of S ceramic sensor

			ui16AdcData = CN0395_ReadAdc(sMeasVar);
			fVoltage = AD7988_DataToVoltage(ui16AdcData); // Convert ADC data to Voltage

			if(enSubroutine == RESISTANCE) {
				fActualValue = (fVoltage / fInputCurrent) * pow(10,
						3); // Constant resistance correction
			} else {
				fActualValue = fVoltage; // Constant voltage correction
			}

			if (fDesiredValue > fActualValue) {
				fError = (fDesiredValue - fActualValue) / fDesiredValue;  // calculate the error
				fInputCurrent = fInputCurrent + fInputCurrent * 0.1 *
						fError; // correct IH for the error //correction factor changed to 0.1 from 0.5
			} else {
				fError = (fActualValue - fDesiredValue) / fDesiredValue; // calculate the error
				fInputCurrent = fInputCurrent - fInputCurrent * 0.1 *
						fError; // correct IH for the error //correction factor changed to 0.1 from 0.5
			}
		} else {
			AppPrintf("\n");
			AppPrintf("Cannot set heater current (IH) to %f. Maximum full scale current is %.2f mA!",
				  fInputCurrent, ADN8810_IFS);
			AppPrintf("\n");
			break;
		}
	}

	sMeasVar->fHeaterVoltage = fVoltage;
	sMeasVar->fHeaterCurrent = fInputCurrent;
}


/**
   @brief Function for <voltage> command which calls the routine for setting heater voltage
          to constant voltage VH and displays the available data.

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @return None.

   Note: this will not work properly on AS modified board
**/
void CN0395_CmdSetHeaterVoltage(uint8_t *args, sMeasurementVariables *sMeasVar)
{
	uint8_t  *p = args;
	char     arg[3];
	float    fDesiredVoltage;
	float    fCurrent;
//	const uint8_t ui8HeaterRes = 225; // 225Ω
	const uint8_t ui8HeaterRes = 30; // upper limit of AS sensor heater resistance

	while (*(p = CN0395_FindArgv(p)) !=
	       '\0') {         /* Check if this function gets an argument */
		CN0395_GetArgv(arg, p);
	}
	fDesiredVoltage = atof(arg); // convert string to float
	fCurrent = (fDesiredVoltage / ui8HeaterRes) * pow(10, 3); // mA

	AD7988_SetOperationMode(AD7988_RH_MODE);

	CN0395_CorrectError(sMeasVar, fCurrent, fDesiredVoltage, VOLTAGE);

	CN0395_ComputeHeaterRPT(sMeasVar); // Compute RH, PH and TH

	// Update Ro value //not in use for AS modified board
//	sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//	while (sMeasVar->fSensorResCleanAir <
//	       0) { // in case of error, repeat measurement
//		timer_sleep(500);
//		sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//	}
	sMeasVar->OpMode = AD7988_RH_MODE;
	CN0395_DisplayData(sMeasVar);
}

/**
   @brief Function for <resistance> command which calls the routine for setting heater resistance
          to constant resistance RH and displays the available data.

   @param sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @return None.

   Note: R-I relationship dictates how fCurrent is estimated.
   So, it's important to get it right based on experimental data. This means new calibration might be needed for every sensor!
**/
void CN0395_CmdSetHeaterRes(uint8_t *args, sMeasurementVariables *sMeasVar)
{
	uint8_t     *p = args;
	char        arg[3];
	float       fDesiredHeaterRes;
	float       fCurrent = 8; //8 not used for AS modified board
//	const float fHeaterRes = 110; // 110Ω @ 20°C //not used for AS modified board


	while (*(p = CN0395_FindArgv(p)) !=
	       '\0') {         /* Check if this function gets an argument */
		CN0395_GetArgv(arg, p);
	}

	fDesiredHeaterRes = atof(arg); // convert string to float
	// Note: The slope of the RH vs.IH curve is 115Ω/8mA = 14375Ω/A
//	fCurrent = ((fDesiredHeaterRes - fHeaterRes) / 14375) * pow(10, 3);
	// the new R-I curve suggested polynomial relationship, y = ax^2 + bx + c -> x = (-b+sqrt(b^2-4a(c-y)))/2a
//	fCurrent = (-0.0073 + sqrt(pow(0.0072, 2) - 4*0.0005*(10.102-fDesiredHeaterRes))) / (2*0.0005); // for HT-1
	fCurrent = (-0.0495 + sqrt(pow(0.0495, 2) - 4*0.0003*(10.521-fDesiredHeaterRes))) / (2*0.0003); // for HT-2

