edanesh/EVAL-ADICUP360/projects/ADuCM360_demo_cn0395/src/CN0395.c
	AD7988_SetOperationMode(AD7988_RH_MODE);

	CN0395_CorrectError(sMeasVar, fCurrent, fDesiredHeaterRes, RESISTANCE);

	CN0395_ComputeHeaterRPT(sMeasVar); // Compute RH, PH and TH

	// Update Ro value //not in use for AS modified board
//	sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//	while (sMeasVar->fSensorResCleanAir <
//	       0) { // in case of error, repeat measurement
//		timer_sleep(500);
//		sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//	}
	sMeasVar->OpMode = AD7988_RH_MODE;
	CN0395_DisplayData(sMeasVar);
}

/**
   @brief Routine for Setting Heater Temperature to Constant Temperature TH (The default value is TH = 360 C)

   @param *sMeasVar - pointer to the struct that contains all the relevant measurement variables

   @return None.

   Note:
**/
void CN0395_CmdSetHeaterTemp(uint8_t *args, sMeasurementVariables *sMeasVar)
{
	uint8_t     *p = args;
	char        arg[3];
	float       fDesiredHeaterTemp;
	float       fAmbientHeaterTemp;
	float       fDesiredHeaterRes;
	float       fAmbientHeaterRes;
	float       fHum;
	float       fCurrent;
	float		fzeroHeaterRes; // new variable for AS modified board
//	const float fDefaultHeaterRes = 110; // 110Ω @ 20°C

	while (*(p = CN0395_FindArgv(p)) !=
	       '\0') {         /* Check if this function gets an argument */
		CN0395_GetArgv(arg, p);
	}

	fDesiredHeaterTemp = atof(arg); // convert string to float

	SHT30_Update(&fAmbientHeaterTemp, &fHum);

	AD7988_SetOperationMode(AD7988_RH_MODE);

	fAmbientHeaterRes = sMeasVar->fAmbientHeaterRes; // get RH_A set initially at power on
	fzeroHeaterRes = sMeasVar->fzeroHeaterRes; // get RH_o set initially at power on

//	// RH_T = RH_A [ 1 + ALPHA*(RH_0/RH_A)*(T – T_A)]
//	fDesiredHeaterRes = fAmbientHeaterRes *
//			    (1 + ALPHA * (fDefaultHeaterRes / fAmbientHeaterRes) * (fDesiredHeaterTemp -
//					    fAmbientHeaterTemp));

	// RH_T = RH_A [ 1 + ALPHA * (T - 0)]
	fDesiredHeaterRes = fzeroHeaterRes * (1 + ALPHA * (fDesiredHeaterTemp));
	sMeasVar->fDesiredHeaterRes = fDesiredHeaterRes;
	AppPrintf("\r\nHeater Resistance set to :    RH   = %.2f [Ohm], waiting for correction",
		  fDesiredHeaterRes);

	// the new R-I curve suggested polynomial relationship, y = ax^2 + bx + c -> x = (-b+sqrt(b^2-4a(c-y)))/2a
//	fCurrent = (-0.0073 + sqrt(pow(0.0072, 2) - 4*0.0005*(10.102-fDesiredHeaterRes))) / (2*0.0005); // for HT-1
	fCurrent = (-0.0495 + sqrt(pow(0.0495, 2) - 4*0.0003*(10.521-fDesiredHeaterRes))) / (2*0.0003); // for HT-2

	AppPrintf("\r\nHeater Current guessed to be:      IH    = %.4f [mA]",
						  fCurrent);

	CN0395_CorrectError(sMeasVar, fCurrent, fDesiredHeaterRes, RESISTANCE);

//	CN0395_CorrectError(sMeasVar, fCurrent, sMeasVar->fHeaterVoltage, VOLTAGE); unclear why it is needed!

	CN0395_ComputeHeaterRPT(sMeasVar); // Compute RH, PH and TH
	// Update Ro value //not in use for AS modified board
//	sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//	while (sMeasVar->fSensorResCleanAir <
//	       0) { // in case of error, repeat measurement
//		timer_sleep(500);
//		sMeasVar->fSensorResCleanAir = CN0395_MeasureSensorResistance(sMeasVar);
//	}
	sMeasVar->OpMode = AD7988_RH_MODE;
	CN0395_DisplayData(sMeasVar);
}

/**
   @brief Read ADC data

   @param None.

   @return ui16Adcdata - data read from ADC via SPI.
**/
uint16_t CN0395_ReadAdc(sMeasurementVariables *sMeasVar)
{
	uint16_t ui16Adcdata;

	for (uint8_t i = 0; i < 5;
	     i++) { // Ignore the first readings until the voltage stabilizes
		AD7988_ReadData(&ui16Adcdata); // Read ADC data
	}

	sMeasVar->ui16LastAdcDataRead = ui16Adcdata;

	return ui16Adcdata;
}

/**
 * @brief Calculate RS value
 *
 * @param ui16Adcdata - ADC code
 * @param ui32RgValue - Gain resistance value
 *
 * @return fRsValue - RS value.
 *
 * Note: currently not adapted to AS sensor
**/
float CN0395_CalculateRs(uint16_t ui16Adcdata, uint32_t ui32RgValue)
{
	float fRsValue;

	fRsValue = ((float)ui16Adcdata * 0.5 * (float)ui32RgValue ) / ((
				float)65536 - 0.5 * (float)ui16Adcdata);

	return fRsValue;
}

/**
 * @brief Calculate gas concentration in PPM
 *
 * @param *sMeasVar - pointer to the struct that contains all the relevant measurement variables
 *
 * @return fConcentration - gas concentration in PPM
 *
 * Note: currently not adapted to AS sensor
**/
float CN0395_CalculatePPM(sMeasurementVariables *sMeasVar)
{
	float fConcentration = 0;
	float fRs = sMeasVar->fSensorRes;
	float fRo = sMeasVar->fSensorResCleanAir;

	if( ((fRs/fRo) >= 0.25) && ((fRs/fRo) <= 0.6) ) {
		fConcentration = 2.61 * pow((fRs/fRo), -2.63);
	} else if((fRs/fRo) > 0.6) {
		fConcentration = 0.550 * pow((fRs/fRo), -5.68);
	}

	return fConcentration;
}

/**
   @brief Finds the next command line argument

   @param args - pointer to the arguments on the command line.

   @return pointer to the next argument.


**/
uint8_t *CN0395_FindArgv(uint8_t *args)
{
	uint8_t  *p = args;
	int         fl = 0;

	while (*p != 0) {
		if ((*p == _SPC)) {
			fl = 1;

		} else {
			if (fl) {
				break;
			}
		}

		p++;
	}

	return p;
}

/**
   @brief Separates a command line argument

    @param dst - pointer to a buffer where the argument will be copied
    @param args - pointer to the current position of the command line .

   @return none

**/
void CN0395_GetArgv(char *dst, uint8_t *args)
{
	uint8_t  *s = args;
	char     *d = dst;

	while (*s) {
		if (*s == _SPC) {
			break;
		}

		*d++ = *s++;
	}

	*d = '\0';
}
